OpenFOAM-10/etc/templates/closedVolumeRotating/system/createBafflesDict-AMI
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

fields true;

baffles
{
    baffleFaces
    {
        type        faceZone;
        zoneName    rotatingZone;

        patches
        {
            master
            {
                name            AMI1;
                type            cyclicAMI;
                neighbourPatch  AMI2;
            }
            slave
            {
                name            AMI2;
                type            cyclicAMI;
                neighbourPatch  AMI1;
            }
        }
    }
}

// ************************************************************************* //
